In [1]:
import requests
import pandas as pd
from pandas.io.json import json_normalize
from config import *

In [4]:
yelp_url = requests.get('https://api.yelp.com/v3/businesses/search',
                       params = {'location': 'Vancouver'},
                       headers = {'Authorization': 'Bearer ' + yelp_api})

In [5]:
yelp_url

In [6]:
yelp_json = yelp_url.json()
df_yelp = pd.json_normalize(yelp_json, record_path = 'businesses')
df_yelp.head()

# name, review_count, rating

pop = df_yelp[['name', 'review_count', 'rating']]
pop.sort_values('review_count', ascending = False).head(10)

                         name  review_count  rating
1                 Medina Cafe          2309     4.0
2                        Miku          1816     4.5
4                     Chambar          1363     4.0
6                  Phnom Penh          1306     4.0
3          Jam Cafe on Beatty          1104     4.5
17  The Flying Pig - Yaletown          1090     4.0
10               Twisted Fork          1036     4.0
16                    Japadog           991     4.0
9     Hokkaido Ramen Santouka           946     4.0
0                Stanley Park           946     5.0

In [7]:
pop.sort_values('rating', ascending = False).head(3)

            name  review_count  rating
0   Stanley Park           946     5.0
13         Fable           682     4.5
2           Miku          1816     4.5